Revit 2026 API

# BrowserOrganizationType Enumeration

---

Enumerated type representing the type of browser organization.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum BrowserOrganizationType
```
```vb
Public Enumeration BrowserOrganizationType
```
```cpp
public enum class BrowserOrganizationType
```
```fsharp
type BrowserOrganizationType
```

| Member name | Value | Description |
| --- | --- | --- |
| PanelSchedules | 4 | The browser organization definition for panel schedules. |
| Schedules | 3 | The browser organization definition for schedules. |
| Sheets | 1 | The browser organization definition for sheets. |
| Views | 0 | The browser organization definition for views. |

#### Reference

Autodesk.Revit.DB Namespace